using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Store2f.ViewModels
{
    internal class Saving_Date
    {
        public static List<User> people = [new User(1, "Admin", "Admin", "Admin", true)];
        public static List<Product> products = [new Product(0, "Apple", " американская корпорация, разработчик персональных и планшетных компьютеров, аудиоплееров, смартфонов, программного обеспечения и цифрового контента. Штаб-квартира расположена в Купертино, штат Калифорния. Практически вся продукция Apple выпускается контрактными производителями на заводах в Азии, крупнейшим подрядчиком является тайваньская компания Foxconn, крупнейший завод — в Чжэнчжоу[6].\n\nОдин из пионеров в области персональных компьютеров[7] и современных многозадачных операционных систем с графическим интерфейсом. Более половины продаж компании приходится на iPhone, на 2021 год в мире использовалось около 900 млн таких смартфонов[8]. Крупнейшим рынком для компании являются США, также значительна доля в выручке Китая, Японии и ряда стран Европы[9]. ", "Tree", 150, null, 12)];
    }
}
